tap "derailed/k9s"
tap "siderolabs/tap"

brew "awscli"
brew "coreutils"
brew "derailed/k9s/k9s"
brew "diffutils"
brew "docker-compose"
brew "docker"
brew "fzf"
brew "gh"
brew "git"
brew "golangci-lint"
brew "helm"
brew "jq"
brew "kubectl"
brew "kubectx"
brew "make"
brew "mas"
brew "mercurial"
brew "openssl"
brew "pyenv"
brew "readline"
brew "shellcheck"
brew "shfmt"
brew "siderolabs/tap/talosctl"
brew "sqlite3"
brew "tailscale"
brew "tcl-tk"
brew "terraform-docs"
brew "tfenv"
brew "tflint"
brew "tree"
brew "vim"
brew "wget"
brew "xz"
brew "yq"
brew "zlib"

cask "bruno"
cask "hiddenbar"
cask "karabiner-elements"
cask "logi-options+"
cask "mockoon"
cask "monitorcontrol"
cask "pgadmin4"
cask "rancher"
cask "raycast"
cask "visual-studio-code"

mas "Bitwarden", id: 1352778147
