tap "derailed/k9s"
tap "hashicorp/tap"

brew "awscli"
brew "coreutils"
brew "derailed/k9s/k9s"
brew "diffutils"
brew "docker-compose"
brew "docker"
brew "fzf"
brew "gh"
brew "git"
brew "hashicorp/tap/terraform"
brew "helm"
brew "jq"
brew "kubectl"
brew "kubectx"
brew "mas"
brew "mercurial"
brew "openssl"
brew "podman"
brew "pyenv"
brew "readline"
brew "shellcheck"
brew "shfmt"
brew "sqlite3"
brew "tailscale"
brew "tcl-tk"
brew "terraform-docs"
brew "tree"
brew "vim"
brew "xz"
brew "zlib"

cask "hiddenbar"
cask "karabiner-elements"
cask "logi-options+"
cask "monitorcontrol"
cask "podman-desktop"
cask "postman"
cask "raycast"
cask "visual-studio-code"

mas "Bitwarden", id: 1352778147
