tap "derailed/k9s", trusted: true
tap "fluxcd/tap", trusted: true
tap "home-operations/tap", trusted: true
tap "libkrun/krun", trusted: true
tap "siderolabs/tap", trusted: true
tap "terraform-linters/tap", trusted: true

brew "awscli"
brew "b2-tools"
brew "coreutils"
brew "derailed/k9s/k9s"
brew "direnv"
brew "fluxcd/tap/flux"
brew "fzf"
brew "gh"
brew "git"
brew "go"
brew "golangci-lint"
brew "helm"
brew "jq"
brew "kopia"
brew "kubectl"
brew "kubectx"
brew "kustomize"
brew "libkrun/krun/krunkit"
brew "make"
brew "mas"
brew "podman"
brew "rclone"
brew "readline"
brew "shellcheck"
brew "shfmt"
brew "siderolabs/tap/talosctl"
brew "tfenv"
brew "tree"
brew "velero"
brew "vim"
brew "wget"
brew "yq"

cask "bruno"
cask "ghostty"
cask "google-chrome"
cask "home-operations/tap/flate"
cask "karabiner-elements"
cask "kopiaui"
cask "logi-options+"
cask "monitorcontrol"
cask "podman-desktop"
cask "raycast"
cask "terraform-linters/tap/tflint"
cask "tflint"
cask "visual-studio-code"
cask "whatsapp"

mas "Bitwarden", id: 1352778147
mas "WireGuard", id: 1451685025

vscode "eamodio.gitlens"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "kennylong.kubernetes-yaml-formatter"
vscode "mkhl.shfmt"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "redhat.vscode-yaml"
vscode "timonwong.shellcheck"

